src/cf/Documents/уатВводНачальныхДанныхПоАгрегатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатВводНачальныхДанныхПоАгрегатам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатРезультатыОсмотраАгрегатовИЭлементов</xr:Item>
				<xr:Item>AccumulationRegister.уатОстаткиАгрегатов</xr:Item>
				<xr:Item>AccumulationRegister.уатИзносАгрегатов</xr:Item>
				<xr:Item>InformationRegister.уатАгрегатыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийВводОстатковПоАгрегатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Износ</Name>
							<Comment>Износ в валюте шины</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аккумуляторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьНачалоЭксплуатации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Износ</Name>
							<Comment>Износ в валюте шины</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеАгрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьГоденДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Износ</Name>
							<Comment>Износ в валюте шины</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатОстаткиАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатОстаткиАгрегатов</Name>
			<Comment>Остатки агрегатов на складах</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатАгрегатыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатАгрегатыТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеАгрегата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТС</Name>
					<Comment>В составе ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньИзноса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьМОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатСостоянияАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСостоянияАгрегатов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановленоВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоВЗапас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоНеисправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийВводОстатковПоАгрегатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийВводОстатковПоАгрегатам</Name>
			<Comment>Виды операций документа "Ввод остатков по агрегатам"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковПоСкладу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВариантыНачисленияИзносаАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыНачисленияИзносаАгрегатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Период</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачислять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатТипыЭлементовАктаОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыЭлементовАктаОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Шина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агрегат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КузовнойЭлемент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКомплектации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатВводНачальныхДанныхПоАгрегатам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СформироватьТаблицуАгрегатыТС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицуОстаткиАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицуИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицуРезультатыОсмотраАгрегатовИЭлементов(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	Если НЕ УдалениеПроведения Тогда
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатВводНачальныхДанныхПоАгрегатам.СерияНоменклатуры,
		|	уатВводНачальныхДанныхПоАгрегатам.ТС,
		|	уатВводНачальныхДанныхПоАгрегатам.МестоУстановки,
		|	уатВводНачальныхДанныхПоАгрегатам.Состояние
		|ПОМЕСТИТЬ АгрегатыДокумента
		|ИЗ
		|	Документ.уатВводНачальныхДанныхПоАгрегатам.Шины КАК уатВводНачальныхДанныхПоАгрегатам
		|ГДЕ
		|	уатВводНачальныхДанныхПоАгрегатам.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатВводНачальныхДанныхПоАгрегатам.СерияНоменклатуры,
		|	уатВводНачальныхДанныхПоАгрегатам.ТС,
		|	NULL,
		|	уатВводНачальныхДанныхПоАгрегатам.Состояние
		|ИЗ
		|	Документ.уатВводНачальныхДанныхПоАгрегатам.Аккумуляторы КАК уатВводНачальныхДанныхПоАгрегатам
		|ГДЕ
		|	уатВводНачальныхДанныхПоАгрегатам.Ссылка = &Ссылка
		|		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатВводНачальныхДанныхПоАгрегатам.СерияНоменклатуры,
		|	уатВводНачальныхДанныхПоАгрегатам.ТС,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе)
		|ИЗ
		|	Документ.уатВводНачальныхДанныхПоАгрегатам.ПрочиеАгрегаты КАК уатВводНачальныхДанныхПоАгрегатам
		|ГДЕ
		|	уатВводНачальныхДанныхПоАгрегатам.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АгрегатыДокумента.СерияНоменклатуры,
		|	уатОстаткиАгрегатовОстатки.Склад,
		|	уатАгрегатыТССрезПоследних.ТС,
		|	уатАгрегатыТССрезПоследних.МестоУстановки
		|ИЗ
		|	АгрегатыДокумента КАК АгрегатыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатОстаткиАгрегатов.Остатки(&МоментВремени, ) КАК уатОстаткиАгрегатовОстатки
		|		ПО АгрегатыДокумента.СерияНоменклатуры = уатОстаткиАгрегатовОстатки.СерияНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&МоментВремени, ) КАК уатАгрегатыТССрезПоследних
		|		ПО АгрегатыДокумента.СерияНоменклатуры = уатАгрегатыТССрезПоследних.СерияНоменклатуры
		|ГДЕ
		|	(НЕ уатОстаткиАгрегатовОстатки.Склад ЕСТЬ NULL 
		|			ИЛИ НЕ уатАгрегатыТССрезПоследних.СерияНоменклатуры ЕСТЬ NULL )
		|	И уатАгрегатыТССрезПоследних.СостояниеАгрегата <> ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.Снято)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АгрегатыДокумента.СерияНоменклатуры,
		|	уатАгрегатыТССрезПоследних.СерияНоменклатуры КАК СерияНоменклатурыСрез,
		|	уатАгрегатыТССрезПоследних.ТС,
		|	уатАгрегатыТССрезПоследних.МестоУстановки,
		|	уатАгрегатыТССрезПоследних.СостояниеАгрегата
		|ИЗ
		|	АгрегатыДокумента КАК АгрегатыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&МоментВремени, ) КАК уатАгрегатыТССрезПоследних
		|		ПО АгрегатыДокумента.ТС = уатАгрегатыТССрезПоследних.ТС
		|			И (ЕСТЬNULL(АгрегатыДокумента.МестоУстановки, ЗНАЧЕНИЕ(Справочник.уатМестаУстановкиШин.ПустаяСсылка)) = уатАгрегатыТССрезПоследних.МестоУстановки)
		|			И АгрегатыДокумента.СерияНоменклатуры.ТипАгрегата = уатАгрегатыТССрезПоследних.СерияНоменклатуры.ТипАгрегата
		|			И АгрегатыДокумента.СерияНоменклатуры <> уатАгрегатыТССрезПоследних.СерияНоменклатуры
		|ГДЕ
		|	НЕ уатАгрегатыТССрезПоследних.СерияНоменклатуры ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АгрегатыДокумента.СерияНоменклатуры КАК СерияНоменклатуры
		|ИЗ
		|	АгрегатыДокумента КАК АгрегатыДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			уатАгрегатыТС.СерияНоменклатуры КАК СерияНоменклатуры
		|		ИЗ
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				уатАгрегатыТС.СерияНоменклатуры КАК СерияНоменклатуры
		|			ИЗ
		|				РегистрСведений.уатАгрегатыТС КАК уатАгрегатыТС
		|			ГДЕ
		|				уатАгрегатыТС.Период < &ДатаСреза
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				уатОстаткиАгрегатовОбороты.СерияНоменклатуры
		|			ИЗ
		|				РегистрНакопления.уатОстаткиАгрегатов.Обороты(, &МоментВремени, , ) КАК уатОстаткиАгрегатовОбороты) КАК уатАгрегатыТС) КАК тблВлож
		|		ПО АгрегатыДокумента.СерияНоменклатуры = тблВлож.СерияНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	АгрегатыДокумента.СерияНоменклатуры";
		
		мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		мЗапрос.УстановитьПараметр("МоментВремени", Новый Граница(ДокументСсылка.Дата, ВидГраницы.Исключая));
		мЗапрос.УстановитьПараметр("ДатаСреза", ДокументСсылка.Дата);
		
		МассивРезультатов = мЗапрос.ВыполнитьПакет();
		
		// Запрещаем ввод остатков, если агрегат уже назначался на какое-либо ТС или уже был на складе
		Если НЕ Отказ Тогда
			ВыборкаКонтроля = МассивРезультатов[3].Выбрать();
			Пока ВыборкаКонтроля.Следующий() Цикл
				Если ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина Тогда
					ТекстНСТР = НСтр("en='Tire ""%1"" (%2) already carried out following operations: installation on vehicle, removal from vehicle, warehouse operations';ru='По шине ""%1"" (%2) уже выполнялись следующие операции: установка на ТС, снятие с ТС, складские операции'");
				ИначеЕсли ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Аккумулятор Тогда
					ТекстНСТР = НСтр("en='For battery ""%1"" (%2) already carried out the following operations: installation on vehicle, removal from vehicle, warehouse operations';ru='По аккумулятору ""%1"" (%2) уже выполнялись следующие операции: установка на ТС, снятие с ТС, складские операции'");
				Иначе
					ТекстНСТР = НСтр("en='By car part ""%1"" (%2) already carried out the following operations: installation on vehicle, removal from vehicle, warehouse operations';ru='По агрегату ""%1"" (%2) уже выполнялись следующие операции: установка на ТС, снятие с ТС, складские операции'");
				КонецЕсли;
				ТекстНСТР = СтрШаблон(ТекстНСТР, ВыборкаКонтроля.СерияНоменклатуры.СерийныйНомер, ВыборкаКонтроля.СерияНоменклатуры.Модель);
						
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЦикла;
		КонецЕсли;
		
		// Проверка на повторное поступление агрегата на склад или повторную установку агрегата на тоже самое ТС
		Если НЕ Отказ Тогда
			ВыборкаКонтроля = МассивРезультатов[1].Выбрать();
			Пока ВыборкаКонтроля.Следующий() Цикл
				Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатковПоАгрегатам.ВводОстатковПоСкладу И ЗначениеЗаполнено(ВыборкаКонтроля.Склад) Тогда
					Если ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Аккумулятор тогда
						ТекстНСТР = НСтр("en='Battery ""%1"" (%2) already exists at warehouse ""%3""';ru='Аккумулятор ""%1"" (%2) уже имеется на складе ""%3""'");
					ИначеЕсли ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина тогда
						ТекстНСТР = НСтр("en='Tire ""%1"" (%2) already exists at warehouse ""%3""';ru='Шина ""%1"" (%2) уже имеется на складе ""%3""'");
					Иначе
						ТекстНСТР = НСтр("en='Car part ""%1"" (%2) already exists at warehouse ""%3""';ru='Агрегат ""%1"" (%2) уже имеется на складе ""%3""'");
					КонецЕсли;
					ТекстНСТР = СтрШаблон(ТекстНСТР, ВыборкаКонтроля.СерияНоменклатуры.СерийныйНомер,
						ВыборкаКонтроля.СерияНоменклатуры.Модель, ВыборкаКонтроля.Склад);
						
					уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);	
					
				ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатковПоАгрегатам.УстановкаНаТС И ЗначениеЗаполнено(ВыборкаКонтроля.ТС) Тогда
					Если ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Аккумулятор тогда
						ТекстНСТР = НСтр("en='Battery ""%1"" (%2) is already installed on the vehicle ""%3""';ru='Аккумулятор ""%1"" (%2) уже установлен на ТС ""%3""'");
					ИначеЕсли ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина тогда
						ТекстНСТР = НСтр("en='Tire ""%1"" (%2) is already installed on vehicle ""%3""';ru='Шина ""%1"" (%2) уже установлена на ТС ""%3""'");
					Иначе
						ТекстНСТР = НСтр("en='Car part ""%1"" (%2) is already installed on vehicle ""%3""';ru='Агрегат ""%1"" (%2) уже установлен на ТС ""%3""'");
					КонецЕсли;
					ТекстНСТР = СтрШаблон(ТекстНСТР, ВыборкаКонтроля.СерияНоменклатуры.СерийныйНомер,
						ВыборкаКонтроля.СерияНоменклатуры.Модель, Строка(ВыборкаКонтроля.ТС));
						
					уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Проверка на установку агрегата на уже занятое место установки
		// здесь просто сообщаем об этом, но не отменяем проведение
		Если НЕ Отказ Тогда
			ВыборкаКонтроля = МассивРезультатов[2].Выбрать();
			Пока ВыборкаКонтроля.Следующий() Цикл
				Если ВыборкаКонтроля.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.Снято
					ИЛИ (ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата <> Справочники.уатТипыАгрегатов.Шина
					И ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата <> Справочники.уатТипыАгрегатов.Аккумулятор) Тогда
					Продолжить;
				КонецЕсли;
				
				ПредставлениеТС = Строка(ВыборкаКонтроля.ТС);
				Если ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Шина Тогда
					ТекстНСТР = НСтр("en='Tire ""%1"" is replaced by ""%2"" is already occupied by tire ""%3"", vehicle ""%4"" !';ru='Шина ""%1"" установлена на место ""%2"", уже занятое шиной ""%3"", ТС ""%4"" !'");
					ТекстНСТР = СтрШаблон(ТекстНСТР, ВыборкаКонтроля.СерияНоменклатуры.СерийныйНомер, СокрЛП(ВыборкаКонтроля.МестоУстановки),
						ВыборкаКонтроля.СерияНоменклатурыСрез.СерийныйНомер, ПредставлениеТС);
						
				ИначеЕсли ВыборкаКонтроля.СерияНоменклатуры.ТипАгрегата = Справочники.уатТипыАгрегатов.Аккумулятор Тогда
					ТекстНСТР = НСтр("en='Battery ""%1"" installed on vehicle ""%2"" is already occupied by battery ""%3"" !';ru='Аккумулятор ""%1"" установлен на ТС ""%2"", уже занятое аккумулятором ""%3"" !'");
					ТекстНСТР = СтрШаблон(ТекстНСТР, ВыборкаКонтроля.СерияНоменклатуры.СерийныйНомер,
						ПредставлениеТС, ВыборкаКонтроля.СерияНоменклатурыСрез.СерийныйНомер);
						
				КонецЕсли;
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР,,, СтатусСообщения.Информация);	
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуАгрегатыТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблАгрегатыТС = Новый ТаблицаЗначений;
	тблАгрегатыТС.Колонки.Добавить("Регистратор");
	тблАгрегатыТС.Колонки.Добавить("Период");
	тблАгрегатыТС.Колонки.Добавить("СерияНоменклатуры");
	тблАгрегатыТС.Колонки.Добавить("ТС");
	тблАгрегатыТС.Колонки.Добавить("СостояниеАгрегата");
	тблАгрегатыТС.Колонки.Добавить("МестоУстановки");
	тблАгрегатыТС.Колонки.Добавить("МОЛ");
	тблАгрегатыТС.Колонки.Добавить("СтепеньИзноса");
	
	Для Каждого ТекСтрока Из ДокументСсылка.Шины Цикл
		НоваяСтрока = тблАгрегатыТС.Добавить();
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Период            = ДокументСсылка.Дата;
		НоваяСтрока.СерияНоменклатуры = ТекСтрока.СерияНоменклатуры;
		Если ТекСтрока.Состояние <> Перечисления.уатСостоянияАгрегатов.Снято Тогда
			НоваяСтрока.МОЛ           = ДокументСсылка.МОЛ;
		КонецЕсли;
		НоваяСтрока.ТС                = ТекСтрока.ТС;
		НоваяСтрока.СостояниеАгрегата = ТекСтрока.Состояние;
		НоваяСтрока.МестоУстановки    = ТекСтрока.МестоУстановки;
		НоваяСтрока.СтепеньИзноса     = ТекСтрока.СтепеньИзноса;
	КонецЦикла;
	Для Каждого ТекСтрока Из ДокументСсылка.Аккумуляторы Цикл
		НоваяСтрока = тблАгрегатыТС.Добавить();
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Период            = ДокументСсылка.Дата;
		НоваяСтрока.СерияНоменклатуры = ТекСтрока.СерияНоменклатуры;
		Если ТекСтрока.Состояние <> Перечисления.уатСостоянияАгрегатов.Снято Тогда
			НоваяСтрока.МОЛ           = ДокументСсылка.МОЛ;
		КонецЕсли;
		НоваяСтрока.ТС                = ТекСтрока.ТС;
		НоваяСтрока.СостояниеАгрегата = ТекСтрока.Состояние;
	КонецЦикла;
	Для Каждого ТекСтрока Из ДокументСсылка.ПрочиеАгрегаты Цикл
		НоваяСтрока = тблАгрегатыТС.Добавить();
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Период            = ДокументСсылка.Дата;
		НоваяСтрока.СерияНоменклатуры = ТекСтрока.СерияНоменклатуры;
		НоваяСтрока.МОЛ               = ДокументСсылка.МОЛ;
		НоваяСтрока.ТС                = ТекСтрока.ТС;
		НоваяСтрока.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаАгрегатовТС", тблАгрегатыТС);
КонецПроцедуры // СформироватьТаблицуАгрегатыТС()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуОстаткиАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблОстаткиАгрегатов = Новый ТаблицаЗначений;
	тблОстаткиАгрегатов.Колонки.Добавить("Регистратор");
	тблОстаткиАгрегатов.Колонки.Добавить("Период");
	тблОстаткиАгрегатов.Колонки.Добавить("Склад");
	тблОстаткиАгрегатов.Колонки.Добавить("СерияНоменклатуры");
	тблОстаткиАгрегатов.Колонки.Добавить("Количество");
	тблОстаткиАгрегатов.Колонки.Добавить("МОЛ");
	
	Для Каждого ТекСтрока Из ДокументСсылка.Шины Цикл
		НоваяСтрока = тблОстаткиАгрегатов.Добавить();
		НоваяСтрока.Регистратор = ДокументСсылка;
		НоваяСтрока.Период = ДокументСсылка.Дата;
		НоваяСтрока.СерияНоменклатуры = ТекСтрока.СерияНоменклатуры;
		НоваяСтрока.МОЛ = ДокументСсылка.МОЛ;
		НоваяСтрока.Склад = ДокументСсылка.Склад;
		НоваяСтрока.Количество = 1;
	КонецЦикла;
	Для Каждого ТекСтрока Из ДокументСсылка.Аккумуляторы Цикл
		НоваяСтрока = тблОстаткиАгрегатов.Добавить();
		НоваяСтрока.Регистратор = ДокументСсылка;
		НоваяСтрока.Период = ДокументСсылка.Дата;
		НоваяСтрока.СерияНоменклатуры = ТекСтрока.СерияНоменклатуры;
		НоваяСтрока.МОЛ = ДокументСсылка.МОЛ;
		НоваяСтрока.Склад = ДокументСсылка.Склад;
		НоваяСтрока.Количество = 1;
	КонецЦикла;
	Для Каждого ТекСтрока Из ДокументСсылка.ПрочиеАгрегаты Цикл
		НоваяСтрока = тблОстаткиАгрегатов.Добавить();
		НоваяСтрока.Регистратор       = ДокументСсылка;
		НоваяСтрока.Период            = ДокументСсылка.Дата;
		НоваяСтрока.СерияНоменклатуры = ТекСтрока.СерияНоменклатуры;
		НоваяСтрока.МОЛ               = ДокументСсылка.МОЛ;
		НоваяСтрока.Склад             = ДокументСсылка.Склад;
		НоваяСтрока.Количество        = 1;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстатковАгрегатов", тблОстаткиАгрегатов);
КонецПроцедуры // СформироватьТаблицуОстаткиАгрегатов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуИзносАгрегатов(ДокументСсылка, СтруктураДополнительныеСвойства)

	мЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Шины.Ссылка КАК Регистратор,
	|	Шины.Ссылка.Дата КАК Период,
	|	Шины.Ссылка.Организация КАК Организация,
	|	Шины.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Шины.ТС КАК ТС,
	|	ВЫБОР
	|		КОГДА Шины.СерияНоменклатуры.Модель.ВариантНачисленияИзноса = ЗНАЧЕНИЕ(Перечисление.уатВариантыНачисленияИзносаАгрегатов.Выработка)
	|			ТОГДА Шины.Пробег
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Пробег,
	|	Шины.Износ КАК Износ
	|ИЗ
	|	Документ.уатВводНачальныхДанныхПоАгрегатам.Шины КАК Шины
	|ГДЕ
	|	Шины.Ссылка = &Ссылка
	|	И (Шины.Пробег <> 0
	|			ИЛИ Шины.Износ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Аккумуляторы.Ссылка,
	|	Аккумуляторы.Ссылка.Дата,
	|	Аккумуляторы.Ссылка.Организация,
	|	Аккумуляторы.СерияНоменклатуры,
	|	Аккумуляторы.ТС,
	|	0,
	|	Аккумуляторы.Износ
	|ИЗ
	|	Документ.уатВводНачальныхДанныхПоАгрегатам.Аккумуляторы КАК Аккумуляторы
	|ГДЕ
	|	Аккумуляторы.Ссылка = &Ссылка
	|	И Аккумуляторы.Износ <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеАгрегаты.Ссылка,
	|	ПрочиеАгрегаты.Ссылка.Дата,
	|	ПрочиеАгрегаты.Ссылка.Организация,
	|	ПрочиеАгрегаты.СерияНоменклатуры,
	|	ПрочиеАгрегаты.ТС,
	|	0,
	|	ПрочиеАгрегаты.Износ
	|ИЗ
	|	Документ.уатВводНачальныхДанныхПоАгрегатам.ПрочиеАгрегаты КАК ПрочиеАгрегаты
	|ГДЕ
	|	ПрочиеАгрегаты.Ссылка = &Ссылка
	|	И ПрочиеАгрегаты.Износ <> 0");
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	тблИзносАгрегатов = мЗапрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаИзносаАгрегатов", тблИзносАгрегатов);
	
КонецПроцедуры // СформироватьТаблицуИзносАгрегатов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРезультатыОсмотраАгрегатовИЭлементов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапросРезультатыОсмотра = Новый Запрос;
	мЗапросРезультатыОсмотра.УстановитьПараметр("Ссылка",     ДокументСсылка);
	мЗапросРезультатыОсмотра.УстановитьПараметр("ПериодПред", ДокументСсылка.Дата-1);
	мЗапросРезультатыОсмотра.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВводНачальныхДанныхПоАгрегатамШины.Ссылка.Дата КАК Период,
	|	уатВводНачальныхДанныхПоАгрегатамШины.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыЭлементовАктаОсмотра.Шина) КАК ТипЭлемента,
	|	уатВводНачальныхДанныхПоАгрегатамШины.ТС КАК ТС,
	|	уатВводНачальныхДанныхПоАгрегатамШины.СерияНоменклатуры КАК АгрегатЭлемент,
	|	уатВводНачальныхДанныхПоАгрегатамШины.Состояние КАК Состояние,
	|	NULL КАК НаличиеПовреждений,
	|	NULL КАК ХарактерПовреждений,
	|	1 КАК Количество,
	|	уатВводНачальныхДанныхПоАгрегатамШины.МестоУстановки КАК МестоУстановки,
	|	уатВводНачальныхДанныхПоАгрегатамШины.СтепеньИзноса КАК СтепеньИзноса,	
	|	уатВводНачальныхДанныхПоАгрегатамШины.МестоУстановки <> ЕСТЬNULL(уатАгрегатыТСПред.МестоУстановки, НЕОПРЕДЕЛЕНО)
	|		ИЛИ уатВводНачальныхДанныхПоАгрегатамШины.СтепеньИзноса <> ЕСТЬNULL(уатАгрегатыТСПред.СтепеньИзноса, НЕОПРЕДЕЛЕНО)
	|		ИЛИ уатВводНачальныхДанныхПоАгрегатамШины.Состояние <> ЕСТЬNULL(уатАгрегатыТСПред.СостояниеАгрегата, НЕОПРЕДЕЛЕНО) КАК Изменен
	|ИЗ
	|	Документ.уатВводНачальныхДанныхПоАгрегатам.Шины КАК уатВводНачальныхДанныхПоАгрегатамШины
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&ПериодПред) КАК уатАгрегатыТСПред
	|	ПО уатВводНачальныхДанныхПоАгрегатамШины.СерияНоменклатуры = уатАгрегатыТСПред.СерияНоменклатуры
	|	И уатВводНачальныхДанныхПоАгрегатамШины.Ссылка.МОЛ = уатАгрегатыТСПред.МОЛ
	|ГДЕ
	|	уатВводНачальныхДанныхПоАгрегатамШины.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатВводНачальныхДанныхПоАгрегатамАккумуляторы.Ссылка.Дата,
	|	уатВводНачальныхДанныхПоАгрегатамАккумуляторы.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыЭлементовАктаОсмотра.Агрегат),
	|	уатВводНачальныхДанныхПоАгрегатамАккумуляторы.ТС,
	|	уатВводНачальныхДанныхПоАгрегатамАккумуляторы.СерияНоменклатуры,
	|	уатВводНачальныхДанныхПоАгрегатамАккумуляторы.Состояние,
	|	NULL,
	|	NULL,
	|	1,
	|	NULL,
	|	NULL,
	|	уатВводНачальныхДанныхПоАгрегатамАккумуляторы.Состояние <> ЕСТЬNULL(уатАгрегатыТСПред.СостояниеАгрегата, НЕОПРЕДЕЛЕНО)
	|ИЗ
	|	Документ.уатВводНачальныхДанныхПоАгрегатам.Аккумуляторы КАК уатВводНачальныхДанныхПоАгрегатамАккумуляторы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&ПериодПред) КАК уатАгрегатыТСПред
	|	ПО уатВводНачальныхДанныхПоАгрегатамАккумуляторы.СерияНоменклатуры = уатАгрегатыТСПред.СерияНоменклатуры
	|	И уатВводНачальныхДанныхПоАгрегатамАккумуляторы.Ссылка.МОЛ = уатАгрегатыТСПред.МОЛ
	|ГДЕ
	|	уатВводНачальныхДанныхПоАгрегатамАккумуляторы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты.Ссылка.Дата,
	|	уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыЭлементовАктаОсмотра.Агрегат),
	|	уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты.ТС,
	|	уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты.СерияНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе),
	|	NULL,
	|	NULL,
	|	1,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе) <> ЕСТЬNULL(уатАгрегатыТСПред.СостояниеАгрегата, НЕОПРЕДЕЛЕНО)
	|ИЗ
	|	Документ.уатВводНачальныхДанныхПоАгрегатам.ПрочиеАгрегаты КАК уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС.СрезПоследних(&ПериодПред) КАК уатАгрегатыТСПред
	|	ПО уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты.СерияНоменклатуры = уатАгрегатыТСПред.СерияНоменклатуры
	|	И уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты.Ссылка.МОЛ = уатАгрегатыТСПред.МОЛ
	|ГДЕ
	|	уатВводНачальныхДанныхПоАгрегатамПрочиеАгрегаты.Ссылка = &Ссылка";
	тблРезультатыОсмотраАгрегатовИЭлементов = мЗапросРезультатыОсмотра.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРезультатыОсмотраАгрегатовИЭлементов", тблРезультатыОсмотраАгрегатовИЭлементов);
	
КонецПроцедуры // СформироватьТаблицуРезультатыОсмотраАгрегатовИЭлементов()

#КонецОбласти

#КонецЕсли
